{"data":{"site":{"siteMetadata":{"title":"Pedro's Software Blog","author":"Pedro Marquez"}},"markdownRemark":{"id":"b4865893-f417-5920-82b2-c15d3d7a492f","excerpt":"After a few months without writing any kind of blog posts, I’ve decided to start my first self-hosted, personal blog. A few months ago I tried to consistently…","html":"<p>After a few months without writing any kind of blog posts, I’ve decided to start my first self-hosted, personal blog. A few months ago I tried to consistently write at <a href=\"https://medium.com/@pfernandom/latest\">Medium</a>, where some of my articles got a pretty good response.</p>\n<p>However, I felt that being a Software Engineer and not coding my own blog was ironic, at least. And while I didn’t code it from the ground up (thanks <a href=\"https://github.com/gatsbyjs/gatsby-starter-blog\">Gatsby</a>), I have more control over it.</p>\n<p>So, for my first post, I decided to share a bit the weirdness of being a father of two kids with very different ages, here at the Bay Area.</p>\n<h2>Personal Time Off</h2>\n<p>Taking time out of work is a <a href=\"https://bit.ly/2I5cCUj\">polarizing topic</a> for Silicon Valley: Either you should at least be <a href=\"https://cnb.cx/2JZcnfW\">working 25 hours a day</a> to be a successful entrepreneur, <a href=\"https://bit.ly/2CMNApu\">working while your competition rests</a>, and spending your weekends building side projects; or you should completely disconnect from Internet, never writing a single line of code outside of work hours.</p>\n<p>So, when you have the fortune of having time out for a few months when your baby is born (thank you LinkedIn), what should you do in those rare moments when the baby is asleep, chores are mostly of done and you feel like you want to try some cool new framework?<br>\nWhich faction do you want to belong to?</p>","frontmatter":{"title":"Fatherhood in Silicon Valley","date":"April 01, 2019","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2019/4/fatherhood/","previous":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Hello World"}},"next":null}}